------------------------------------------------------------
  synth_5stage (rv32i_pipeline_5stage_top)
------------------------------------------------------------
  Fmax (est) : 77.8 MHz
  WNS        : -7.846 ns
  LUTs       : 6793
  FFs        : 8129
  DSPs       : 12
  BRAMs      : 0

------------------------------------------------------------
  synth_6stage (rv32i_pipeline_top)
------------------------------------------------------------
  Fmax (est) : 121.1 MHz
  WNS        : -3.259 ns
  LUTs       : 7015
  FFs        : 8403
  DSPs       : 12
  BRAMs      : 0

------------------------------------------------------------
  synth_7stage (rv32i_pipeline_7stage_top)
------------------------------------------------------------
  Fmax (est) : 115.3 MHz
  WNS        : -3.672 ns
  LUTs       : 7069
  FFs        : 8489
  DSPs       : 12
  BRAMs      : 0

